import unittest
from msg_split import unit_test_parse

sample_1_1 = """невозможно выполнить анализ с заданной длиной фрагмента"""

sample_1_2 = """Фрагмент 1 начинать==============================
<strong>
 Done
</strong>
<i></i>
Фрагмент конец ===================================
Фрагмент 2 начинать==============================
<i>
<a href="https://mockdata.atlassian.net/browse/ABC-12508"></a></i>
Фрагмент конец ===================================
Фрагмент 3 начинать==============================
<i><a>
<code></code></a></i>
Фрагмент конец ===================================
Фрагмент 4 начинать==============================
<i><a><code>
   ABC-12508
  </code>
</a></i>
Фрагмент конец ===================================
Фрагмент 5 начинать==============================
<i>
 Vestibulum pellentesque ullamcorper sapien sed venenatis.
 <a href="https://mockdata.atlassian.net/browse/ABC-12587"></a></i>
Фрагмент конец ===================================
Фрагмент 6 начинать==============================
<i><a>
<code></code></a></i>
Фрагмент конец ===================================
Фрагмент 7 начинать==============================
<i><a><code>
   ABC-12587
  </code>
</a></i>
Фрагмент конец ===================================
Фрагмент 8 начинать==============================
<i>
 Integer et erat mollis, tempor sem a, fringilla est.
</i>
Фрагмент конец ===================================
Фрагмент 9 начинать==============================

Фрагмент конец ==================================="""

sample_2_1 = """невозможно выполнить анализ с заданной длиной фрагмента"""

sample_2_2 = """невозможно выполнить анализ с заданной длиной фрагмента"""

sample_2_3 = """Фрагмент 1 начинать==============================
<a href="tg://user?id=3485734953">
 Talbert Gannaway
</a>
<strong></strong>
Фрагмент конец ===================================
Фрагмент 2 начинать==============================
<strong>
 In progress
</strong>
<a href="https://mockdata.atlassian.net/browse/ABC-12634">
<code></code></a>
Фрагмент конец ===================================
Фрагмент 3 начинать==============================
<a><code>
  ABC-12634
 </code>
</a>
Lorem ipsum dolor sit amet, consectetur adipiscing elit.
<strong></strong>
Фрагмент конец ===================================
Фрагмент 4 начинать==============================
<strong>
 Done
</strong>
<i>
<a href="https://mockdata.atlassian.net/browse/ABC-12508"></a></i>
Фрагмент конец ===================================
Фрагмент 5 начинать==============================
<i><a>
<code>
   ABC-12508
  </code>
</a></i>
Фрагмент конец ===================================
Фрагмент 6 начинать==============================
<i>
 Vestibulum pellentesque ullamcorper sapien sed venenatis.
 <a href="https://mockdata.atlassian.net/browse/ABC-12587"></a></i>
Фрагмент конец ===================================
Фрагмент 7 начинать==============================
<i><a>
<code>
   ABC-12587
  </code>
</a></i>
Фрагмент конец ===================================
Фрагмент 8 начинать==============================
<i>
 Integer et erat mollis, tempor sem a, fringilla est.
</i>
<a href="tg://user?id=604521009"></a>
Фрагмент конец ===================================
Фрагмент 9 начинать==============================
<a>
 Jilly Paolillo
</a>
<strong>
 Done
</strong>
<a href="https://mockdata.atlassian.net/browse/ABC-12255"></a>
Фрагмент конец ===================================
Фрагмент 10 начинать==============================
<a>
<code>
  ABC-12255
 </code>
</a>
Фрагмент конец ===================================
Фрагмент 11 начинать==============================
<a href="https://mockdata.atlassian.net/browse/ABC-12365"></a>
Фрагмент конец ===================================
Фрагмент 12 начинать==============================
<a>
<code>
  ABC-12365
 </code>
</a>
Фрагмент конец ===================================
Фрагмент 13 начинать==============================
<strong></strong>
Фрагмент конец ===================================
Фрагмент 14 начинать==============================
<strong>
 In progress
</strong>
<a href="https://mockdata.atlassian.net/browse/ABC-11571">
<code></code></a>
Фрагмент конец ===================================
Фрагмент 15 начинать==============================
<a><code>
  ABC-11571
 </code>
</a>
Cras sodales dignissim nibh in placerat.
<a href="https://mockdata.atlassian.net/browse/ABC-12612"></a>
Фрагмент конец ===================================
Фрагмент 16 начинать==============================
<a>
<code>
  ABC-12612
 </code>
</a>
Cras vel orci justo.

Фрагмент конец ==================================="""

class TestMsgSplit(unittest.TestCase):
    def test1(self):
        self.assertEqual(unit_test_parse("test-1.html", 10).strip(), sample_1_1)
        self.assertEqual(unit_test_parse("test-1.html", 50).strip(), sample_1_2)

    def test2(self):
        self.assertEqual(unit_test_parse("test-2.html", 10).strip(), sample_2_1)
        self.assertEqual(unit_test_parse("test-2.html", 50).strip(), sample_2_2)
        self.assertEqual(unit_test_parse("test-2.html", 100).strip(), sample_2_3)
        
if __name__ == '__main__':
    unittest.main()
